app/controllers/categories_controller.rb

INSERT INTO `categories` (`updated_at`, `title`, `created_at`) VALUES('2009-01-16 06:22:38', 'new test category', '2009-01-16 06:22:38')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
UPDATE `categories` SET `title` = 'new test categoriesk', `updated_at` = '2009-01-16 06:52:30' WHERE `id` = 2
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])