app/controllers/tasks_controller.rb

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`updated_at`, `description`, `created_at`) VALUES('2009-01-17 19:41:55', 'lah', '2009-01-17 19:41:55')

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 4)
UPDATE `tasks` SET `description` = 'buy bagels', `updated_at` = '2009-01-17 19:57:18' WHERE `id` = 4

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
DELETE FROM `tasks` WHERE `id` = 1